# CreateFillSpace

## Description
Creates a new fillspace object and attaches it to the end of the aux list of the specified object.

```pascal
FUNCTION CreateFillSpace(owner : HANDLE) : HANDLE;
```

```python

def vs.CreateFillSpace(owner):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|owner|HANDLE|Handle to the object in whose aux list the fill space will be created.|

## Returns
Handle to the newly created fill space object.

## Version
Availability: from Vectorworks 2018
## Category
* Object Attributes